{
    "pos_resolution": 12,
    "max_ts_denominator_power": 6,
    "max_ts_denominator": 64,
    "max_notes_per_bar": 2,
    "tempo_quant": 12,
    "min_tempo": 16,
    "max_tempo": 256,
    "velocity_quant": 4,
    "max_duration": 8,
    "beat_note_factor": 4,
    "max_bar_num": 256,
    "ts_dict": {
        "(1, 1)": 0,
        "(2, 1)": 1,
        "(1, 2)": 2,
        "(2, 2)": 3,
        "(3, 2)": 4,
        "(4, 2)": 5,
        "(1, 4)": 6,
        "(2, 4)": 7,
        "(3, 4)": 8,
        "(4, 4)": 9,
        "(5, 4)": 10,
        "(6, 4)": 11,
        "(7, 4)": 12,
        "(8, 4)": 13,
        "(1, 8)": 14,
        "(2, 8)": 15,
        "(3, 8)": 16,
        "(4, 8)": 17,
        "(5, 8)": 18,
        "(6, 8)": 19,
        "(7, 8)": 20,
        "(8, 8)": 21,
        "(9, 8)": 22,
        "(10, 8)": 23,
        "(11, 8)": 24,
        "(12, 8)": 25,
        "(13, 8)": 26,
        "(14, 8)": 27,
        "(15, 8)": 28,
        "(16, 8)": 29,
        "(1, 16)": 30,
        "(2, 16)": 31,
        "(3, 16)": 32,
        "(4, 16)": 33,
        "(5, 16)": 34,
        "(6, 16)": 35,
        "(7, 16)": 36,
        "(8, 16)": 37,
        "(9, 16)": 38,
        "(10, 16)": 39,
        "(11, 16)": 40,
        "(12, 16)": 41,
        "(13, 16)": 42,
        "(14, 16)": 43,
        "(15, 16)": 44,
        "(16, 16)": 45,
        "(17, 16)": 46,
        "(18, 16)": 47,
        "(19, 16)": 48,
        "(20, 16)": 49,
        "(21, 16)": 50,
        "(22, 16)": 51,
        "(23, 16)": 52,
        "(24, 16)": 53,
        "(25, 16)": 54,
        "(26, 16)": 55,
        "(27, 16)": 56,
        "(28, 16)": 57,
        "(29, 16)": 58,
        "(30, 16)": 59,
        "(31, 16)": 60,
        "(32, 16)": 61,
        "(1, 32)": 62,
        "(2, 32)": 63,
        "(3, 32)": 64,
        "(4, 32)": 65,
        "(5, 32)": 66,
        "(6, 32)": 67,
        "(7, 32)": 68,
        "(8, 32)": 69,
        "(9, 32)": 70,
        "(10, 32)": 71,
        "(11, 32)": 72,
        "(12, 32)": 73,
        "(13, 32)": 74,
        "(14, 32)": 75,
        "(15, 32)": 76,
        "(16, 32)": 77,
        "(17, 32)": 78,
        "(18, 32)": 79,
        "(19, 32)": 80,
        "(20, 32)": 81,
        "(21, 32)": 82,
        "(22, 32)": 83,
        "(23, 32)": 84,
        "(24, 32)": 85,
        "(25, 32)": 86,
        "(26, 32)": 87,
        "(27, 32)": 88,
        "(28, 32)": 89,
        "(29, 32)": 90,
        "(30, 32)": 91,
        "(31, 32)": 92,
        "(32, 32)": 93,
        "(33, 32)": 94,
        "(34, 32)": 95,
        "(35, 32)": 96,
        "(36, 32)": 97,
        "(37, 32)": 98,
        "(38, 32)": 99,
        "(39, 32)": 100,
        "(40, 32)": 101,
        "(41, 32)": 102,
        "(42, 32)": 103,
        "(43, 32)": 104,
        "(44, 32)": 105,
        "(45, 32)": 106,
        "(46, 32)": 107,
        "(47, 32)": 108,
        "(48, 32)": 109,
        "(49, 32)": 110,
        "(50, 32)": 111,
        "(51, 32)": 112,
        "(52, 32)": 113,
        "(53, 32)": 114,
        "(54, 32)": 115,
        "(55, 32)": 116,
        "(56, 32)": 117,
        "(57, 32)": 118,
        "(58, 32)": 119,
        "(59, 32)": 120,
        "(60, 32)": 121,
        "(61, 32)": 122,
        "(62, 32)": 123,
        "(63, 32)": 124,
        "(64, 32)": 125,
        "(1, 64)": 126,
        "(2, 64)": 127,
        "(3, 64)": 128,
        "(4, 64)": 129,
        "(5, 64)": 130,
        "(6, 64)": 131,
        "(7, 64)": 132,
        "(8, 64)": 133,
        "(9, 64)": 134,
        "(10, 64)": 135,
        "(11, 64)": 136,
        "(12, 64)": 137,
        "(13, 64)": 138,
        "(14, 64)": 139,
        "(15, 64)": 140,
        "(16, 64)": 141,
        "(17, 64)": 142,
        "(18, 64)": 143,
        "(19, 64)": 144,
        "(20, 64)": 145,
        "(21, 64)": 146,
        "(22, 64)": 147,
        "(23, 64)": 148,
        "(24, 64)": 149,
        "(25, 64)": 150,
        "(26, 64)": 151,
        "(27, 64)": 152,
        "(28, 64)": 153,
        "(29, 64)": 154,
        "(30, 64)": 155,
        "(31, 64)": 156,
        "(32, 64)": 157,
        "(33, 64)": 158,
        "(34, 64)": 159,
        "(35, 64)": 160,
        "(36, 64)": 161,
        "(37, 64)": 162,
        "(38, 64)": 163,
        "(39, 64)": 164,
        "(40, 64)": 165,
        "(41, 64)": 166,
        "(42, 64)": 167,
        "(43, 64)": 168,
        "(44, 64)": 169,
        "(45, 64)": 170,
        "(46, 64)": 171,
        "(47, 64)": 172,
        "(48, 64)": 173,
        "(49, 64)": 174,
        "(50, 64)": 175,
        "(51, 64)": 176,
        "(52, 64)": 177,
        "(53, 64)": 178,
        "(54, 64)": 179,
        "(55, 64)": 180,
        "(56, 64)": 181,
        "(57, 64)": 182,
        "(58, 64)": 183,
        "(59, 64)": 184,
        "(60, 64)": 185,
        "(61, 64)": 186,
        "(62, 64)": 187,
        "(63, 64)": 188,
        "(64, 64)": 189,
        "(65, 64)": 190,
        "(66, 64)": 191,
        "(67, 64)": 192,
        "(68, 64)": 193,
        "(69, 64)": 194,
        "(70, 64)": 195,
        "(71, 64)": 196,
        "(72, 64)": 197,
        "(73, 64)": 198,
        "(74, 64)": 199,
        "(75, 64)": 200,
        "(76, 64)": 201,
        "(77, 64)": 202,
        "(78, 64)": 203,
        "(79, 64)": 204,
        "(80, 64)": 205,
        "(81, 64)": 206,
        "(82, 64)": 207,
        "(83, 64)": 208,
        "(84, 64)": 209,
        "(85, 64)": 210,
        "(86, 64)": 211,
        "(87, 64)": 212,
        "(88, 64)": 213,
        "(89, 64)": 214,
        "(90, 64)": 215,
        "(91, 64)": 216,
        "(92, 64)": 217,
        "(93, 64)": 218,
        "(94, 64)": 219,
        "(95, 64)": 220,
        "(96, 64)": 221,
        "(97, 64)": 222,
        "(98, 64)": 223,
        "(99, 64)": 224,
        "(100, 64)": 225,
        "(101, 64)": 226,
        "(102, 64)": 227,
        "(103, 64)": 228,
        "(104, 64)": 229,
        "(105, 64)": 230,
        "(106, 64)": 231,
        "(107, 64)": 232,
        "(108, 64)": 233,
        "(109, 64)": 234,
        "(110, 64)": 235,
        "(111, 64)": 236,
        "(112, 64)": 237,
        "(113, 64)": 238,
        "(114, 64)": 239,
        "(115, 64)": 240,
        "(116, 64)": 241,
        "(117, 64)": 242,
        "(118, 64)": 243,
        "(119, 64)": 244,
        "(120, 64)": 245,
        "(121, 64)": 246,
        "(122, 64)": 247,
        "(123, 64)": 248,
        "(124, 64)": 249,
        "(125, 64)": 250,
        "(126, 64)": 251,
        "(127, 64)": 252,
        "(128, 64)": 253
    },
    "ts_list": [
        [
            1,
            1
        ],
        [
            2,
            1
        ],
        [
            1,
            2
        ],
        [
            2,
            2
        ],
        [
            3,
            2
        ],
        [
            4,
            2
        ],
        [
            1,
            4
        ],
        [
            2,
            4
        ],
        [
            3,
            4
        ],
        [
            4,
            4
        ],
        [
            5,
            4
        ],
        [
            6,
            4
        ],
        [
            7,
            4
        ],
        [
            8,
            4
        ],
        [
            1,
            8
        ],
        [
            2,
            8
        ],
        [
            3,
            8
        ],
        [
            4,
            8
        ],
        [
            5,
            8
        ],
        [
            6,
            8
        ],
        [
            7,
            8
        ],
        [
            8,
            8
        ],
        [
            9,
            8
        ],
        [
            10,
            8
        ],
        [
            11,
            8
        ],
        [
            12,
            8
        ],
        [
            13,
            8
        ],
        [
            14,
            8
        ],
        [
            15,
            8
        ],
        [
            16,
            8
        ],
        [
            1,
            16
        ],
        [
            2,
            16
        ],
        [
            3,
            16
        ],
        [
            4,
            16
        ],
        [
            5,
            16
        ],
        [
            6,
            16
        ],
        [
            7,
            16
        ],
        [
            8,
            16
        ],
        [
            9,
            16
        ],
        [
            10,
            16
        ],
        [
            11,
            16
        ],
        [
            12,
            16
        ],
        [
            13,
            16
        ],
        [
            14,
            16
        ],
        [
            15,
            16
        ],
        [
            16,
            16
        ],
        [
            17,
            16
        ],
        [
            18,
            16
        ],
        [
            19,
            16
        ],
        [
            20,
            16
        ],
        [
            21,
            16
        ],
        [
            22,
            16
        ],
        [
            23,
            16
        ],
        [
            24,
            16
        ],
        [
            25,
            16
        ],
        [
            26,
            16
        ],
        [
            27,
            16
        ],
        [
            28,
            16
        ],
        [
            29,
            16
        ],
        [
            30,
            16
        ],
        [
            31,
            16
        ],
        [
            32,
            16
        ],
        [
            1,
            32
        ],
        [
            2,
            32
        ],
        [
            3,
            32
        ],
        [
            4,
            32
        ],
        [
            5,
            32
        ],
        [
            6,
            32
        ],
        [
            7,
            32
        ],
        [
            8,
            32
        ],
        [
            9,
            32
        ],
        [
            10,
            32
        ],
        [
            11,
            32
        ],
        [
            12,
            32
        ],
        [
            13,
            32
        ],
        [
            14,
            32
        ],
        [
            15,
            32
        ],
        [
            16,
            32
        ],
        [
            17,
            32
        ],
        [
            18,
            32
        ],
        [
            19,
            32
        ],
        [
            20,
            32
        ],
        [
            21,
            32
        ],
        [
            22,
            32
        ],
        [
            23,
            32
        ],
        [
            24,
            32
        ],
        [
            25,
            32
        ],
        [
            26,
            32
        ],
        [
            27,
            32
        ],
        [
            28,
            32
        ],
        [
            29,
            32
        ],
        [
            30,
            32
        ],
        [
            31,
            32
        ],
        [
            32,
            32
        ],
        [
            33,
            32
        ],
        [
            34,
            32
        ],
        [
            35,
            32
        ],
        [
            36,
            32
        ],
        [
            37,
            32
        ],
        [
            38,
            32
        ],
        [
            39,
            32
        ],
        [
            40,
            32
        ],
        [
            41,
            32
        ],
        [
            42,
            32
        ],
        [
            43,
            32
        ],
        [
            44,
            32
        ],
        [
            45,
            32
        ],
        [
            46,
            32
        ],
        [
            47,
            32
        ],
        [
            48,
            32
        ],
        [
            49,
            32
        ],
        [
            50,
            32
        ],
        [
            51,
            32
        ],
        [
            52,
            32
        ],
        [
            53,
            32
        ],
        [
            54,
            32
        ],
        [
            55,
            32
        ],
        [
            56,
            32
        ],
        [
            57,
            32
        ],
        [
            58,
            32
        ],
        [
            59,
            32
        ],
        [
            60,
            32
        ],
        [
            61,
            32
        ],
        [
            62,
            32
        ],
        [
            63,
            32
        ],
        [
            64,
            32
        ],
        [
            1,
            64
        ],
        [
            2,
            64
        ],
        [
            3,
            64
        ],
        [
            4,
            64
        ],
        [
            5,
            64
        ],
        [
            6,
            64
        ],
        [
            7,
            64
        ],
        [
            8,
            64
        ],
        [
            9,
            64
        ],
        [
            10,
            64
        ],
        [
            11,
            64
        ],
        [
            12,
            64
        ],
        [
            13,
            64
        ],
        [
            14,
            64
        ],
        [
            15,
            64
        ],
        [
            16,
            64
        ],
        [
            17,
            64
        ],
        [
            18,
            64
        ],
        [
            19,
            64
        ],
        [
            20,
            64
        ],
        [
            21,
            64
        ],
        [
            22,
            64
        ],
        [
            23,
            64
        ],
        [
            24,
            64
        ],
        [
            25,
            64
        ],
        [
            26,
            64
        ],
        [
            27,
            64
        ],
        [
            28,
            64
        ],
        [
            29,
            64
        ],
        [
            30,
            64
        ],
        [
            31,
            64
        ],
        [
            32,
            64
        ],
        [
            33,
            64
        ],
        [
            34,
            64
        ],
        [
            35,
            64
        ],
        [
            36,
            64
        ],
        [
            37,
            64
        ],
        [
            38,
            64
        ],
        [
            39,
            64
        ],
        [
            40,
            64
        ],
        [
            41,
            64
        ],
        [
            42,
            64
        ],
        [
            43,
            64
        ],
        [
            44,
            64
        ],
        [
            45,
            64
        ],
        [
            46,
            64
        ],
        [
            47,
            64
        ],
        [
            48,
            64
        ],
        [
            49,
            64
        ],
        [
            50,
            64
        ],
        [
            51,
            64
        ],
        [
            52,
            64
        ],
        [
            53,
            64
        ],
        [
            54,
            64
        ],
        [
            55,
            64
        ],
        [
            56,
            64
        ],
        [
            57,
            64
        ],
        [
            58,
            64
        ],
        [
            59,
            64
        ],
        [
            60,
            64
        ],
        [
            61,
            64
        ],
        [
            62,
            64
        ],
        [
            63,
            64
        ],
        [
            64,
            64
        ],
        [
            65,
            64
        ],
        [
            66,
            64
        ],
        [
            67,
            64
        ],
        [
            68,
            64
        ],
        [
            69,
            64
        ],
        [
            70,
            64
        ],
        [
            71,
            64
        ],
        [
            72,
            64
        ],
        [
            73,
            64
        ],
        [
            74,
            64
        ],
        [
            75,
            64
        ],
        [
            76,
            64
        ],
        [
            77,
            64
        ],
        [
            78,
            64
        ],
        [
            79,
            64
        ],
        [
            80,
            64
        ],
        [
            81,
            64
        ],
        [
            82,
            64
        ],
        [
            83,
            64
        ],
        [
            84,
            64
        ],
        [
            85,
            64
        ],
        [
            86,
            64
        ],
        [
            87,
            64
        ],
        [
            88,
            64
        ],
        [
            89,
            64
        ],
        [
            90,
            64
        ],
        [
            91,
            64
        ],
        [
            92,
            64
        ],
        [
            93,
            64
        ],
        [
            94,
            64
        ],
        [
            95,
            64
        ],
        [
            96,
            64
        ],
        [
            97,
            64
        ],
        [
            98,
            64
        ],
        [
            99,
            64
        ],
        [
            100,
            64
        ],
        [
            101,
            64
        ],
        [
            102,
            64
        ],
        [
            103,
            64
        ],
        [
            104,
            64
        ],
        [
            105,
            64
        ],
        [
            106,
            64
        ],
        [
            107,
            64
        ],
        [
            108,
            64
        ],
        [
            109,
            64
        ],
        [
            110,
            64
        ],
        [
            111,
            64
        ],
        [
            112,
            64
        ],
        [
            113,
            64
        ],
        [
            114,
            64
        ],
        [
            115,
            64
        ],
        [
            116,
            64
        ],
        [
            117,
            64
        ],
        [
            118,
            64
        ],
        [
            119,
            64
        ],
        [
            120,
            64
        ],
        [
            121,
            64
        ],
        [
            122,
            64
        ],
        [
            123,
            64
        ],
        [
            124,
            64
        ],
        [
            125,
            64
        ],
        [
            126,
            64
        ],
        [
            127,
            64
        ],
        [
            128,
            64
        ]
    ],
    "dur_enc": [
        0,
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        12,
        13,
        13,
        14,
        14,
        15,
        15,
        16,
        16,
        17,
        17,
        18,
        18,
        19,
        19,
        20,
        20,
        21,
        21,
        22,
        22,
        23,
        23,
        24,
        24,
        24,
        24,
        25,
        25,
        25,
        25,
        26,
        26,
        26,
        26,
        27,
        27,
        27,
        27,
        28,
        28,
        28,
        28,
        29,
        29,
        29,
        29,
        30,
        30,
        30,
        30,
        31,
        31,
        31,
        31,
        32,
        32,
        32,
        32,
        33,
        33,
        33,
        33,
        34,
        34,
        34,
        34,
        35,
        35,
        35,
        35,
        36,
        36,
        36,
        36,
        36,
        36,
        36,
        36,
        37,
        37,
        37,
        37,
        37,
        37,
        37,
        37,
        38,
        38,
        38,
        38,
        38,
        38,
        38,
        38,
        39,
        39,
        39,
        39,
        39,
        39,
        39,
        39,
        40,
        40,
        40,
        40,
        40,
        40,
        40,
        40,
        41,
        41,
        41,
        41,
        41,
        41,
        41,
        41,
        42,
        42,
        42,
        42,
        42,
        42,
        42,
        42,
        43,
        43,
        43,
        43,
        43,
        43,
        43,
        43,
        44,
        44,
        44,
        44,
        44,
        44,
        44,
        44,
        45,
        45,
        45,
        45,
        45,
        45,
        45,
        45,
        46,
        46,
        46,
        46,
        46,
        46,
        46,
        46,
        47,
        47,
        47,
        47,
        47,
        47,
        47,
        47,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        48,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        49,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        50,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        51,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        52,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        53,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        54,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        55,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        56,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        57,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        58,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        59,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        60,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        61,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        62,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        63,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        64,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        65,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        66,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        67,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        68,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        69,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        70,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        71,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        72,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        73,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        74,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        75,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        76,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        77,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        78,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        79,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        80,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        81,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        82,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        83,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        84,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        85,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        86,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        87,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        88,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        89,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        90,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
        91,
