{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 2048,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "</s>": 5,
      "b-0": 6,
      "b-1": 7,
      "o-0": 8,
      "o-1": 9,
      "o-2": 10,
      "o-3": 11,
      "o-4": 12,
      "o-5": 13,
      "o-6": 14,
      "o-7": 15,
      "o-8": 16,
      "o-9": 17,
      "o-10": 18,
      "o-11": 19,
      "o-12": 20,
      "o-13": 21,
      "o-14": 22,
      "o-15": 23,
      "o-16": 24,
      "o-17": 25,
      "o-18": 26,
      "o-19": 27,
      "o-20": 28,
      "o-21": 29,
      "o-22": 30,
      "o-23": 31,
      "o-24": 32,
      "o-25": 33,
      "o-26": 34,
      "o-27": 35,
      "o-28": 36,
      "o-29": 37,
      "o-30": 38,
      "o-31": 39,
      "o-32": 40,
      "o-33": 41,
      "o-34": 42,
      "o-35": 43,
      "o-36": 44,
      "o-37": 45,
      "o-38": 46,
      "o-39": 47,
      "o-40": 48,
      "o-41": 49,
      "o-42": 50,
      "o-43": 51,
      "o-44": 52,
      "o-45": 53,
      "o-46": 54,
      "o-47": 55,
      "o-48": 56,
      "o-49": 57,
      "o-50": 58,
      "o-51": 59,
      "o-52": 60,
      "o-53": 61,
      "o-54": 62,
      "o-55": 63,
      "o-56": 64,
      "o-57": 65,
      "o-58": 66,
      "o-59": 67,
      "o-60": 68,
      "o-61": 69,
      "o-62": 70,
      "o-63": 71,
      "o-64": 72,
      "o-65": 73,
      "o-66": 74,
      "o-67": 75,
      "o-68": 76,
      "o-69": 77,
      "o-70": 78,
      "o-71": 79,
      "o-72": 80,
      "o-73": 81,
      "o-74": 82,
      "o-75": 83,
      "o-76": 84,
      "o-77": 85,
      "o-78": 86,
      "o-79": 87,
      "o-80": 88,
      "o-81": 89,
      "o-82": 90,
      "o-83": 91,
      "o-84": 92,
      "o-85": 93,
      "o-86": 94,
      "o-87": 95,
      "o-88": 96,
      "o-89": 97,
      "o-90": 98,
      "o-91": 99,
      "o-92": 100,
      "o-93": 101,
      "o-94": 102,
      "o-95": 103,
      "o-96": 104,
      "o-97": 105,
      "o-98": 106,
      "o-99": 107,
      "o-100": 108,
      "o-101": 109,
      "o-102": 110,
      "o-103": 111,
      "o-104": 112,
      "o-105": 113,
      "o-106": 114,
      "o-107": 115,
      "o-108": 116,
      "o-109": 117,
      "o-110": 118,
      "o-111": 119,
      "o-112": 120,
      "o-113": 121,
      "o-114": 122,
      "o-115": 123,
      "o-116": 124,
      "o-117": 125,
      "o-118": 126,
      "o-119": 127,
      "o-120": 128,
      "o-121": 129,
      "o-122": 130,
      "o-123": 131,
      "o-124": 132,
      "o-125": 133,
      "o-126": 134,
      "o-127": 135,
      "i-0": 136,
      "i-1": 137,
      "i-2": 138,
      "i-3": 139,
      "i-4": 140,
      "i-5": 141,
      "i-6": 142,
      "i-7": 143,
      "i-8": 144,
      "i-9": 145,
      "i-10": 146,
      "i-11": 147,
      "i-12": 148,
      "i-13": 149,
      "i-14": 150,
      "i-15": 151,
      "i-16": 152,
      "i-17": 153,
      "i-18": 154,
      "i-19": 155,
      "i-20": 156,
      "i-21": 157,
      "i-22": 158,
      "i-23": 159,
      "i-24": 160,
      "i-25": 161,
      "i-26": 162,
      "i-27": 163,
      "i-28": 164,
      "i-29": 165,
      "i-30": 166,
      "i-31": 167,
      "i-32": 168,
      "i-33": 169,
      "i-34": 170,
      "i-35": 171,
      "i-36": 172,
      "i-37": 173,
      "i-38": 174,
      "i-39": 175,
      "i-40": 176,
      "i-41": 177,
      "i-42": 178,
      "i-43": 179,
      "i-44": 180,
      "i-45": 181,
      "i-46": 182,
      "i-47": 183,
      "i-48": 184,
      "i-49": 185,
      "i-50": 186,
      "i-51": 187,
      "i-52": 188,
      "i-53": 189,
      "i-54": 190,
      "i-55": 191,
      "i-56": 192,
      "i-57": 193,
      "i-58": 194,
      "i-59": 195,
      "i-60": 196,
      "i-61": 197,
      "i-62": 198,
      "i-63": 199,
      "i-64": 200,
      "i-65": 201,
      "i-66": 202,
      "i-67": 203,
      "i-68": 204,
      "i-69": 205,
      "i-70": 206,
      "i-71": 207,
      "i-72": 208,
      "i-73": 209,
      "i-74": 210,
      "i-75": 211,
      "i-76": 212,
      "i-77": 213,
      "i-78": 214,
      "i-79": 215,
      "i-80": 216,
      "i-81": 217,
      "i-82": 218,
      "i-83": 219,
      "i-84": 220,
      "i-85": 221,
      "i-86": 222,
      "i-87": 223,
      "i-88": 224,
      "i-89": 225,
      "i-90": 226,
      "i-91": 227,
      "i-92": 228,
      "i-93": 229,
      "i-94": 230,
      "i-95": 231,
      "i-96": 232,
      "i-97": 233,
      "i-98": 234,
      "i-99": 235,
      "i-100": 236,
      "i-101": 237,
      "i-102": 238,
      "i-103": 239,
      "i-104": 240,
      "i-105": 241,
      "i-106": 242,
      "i-107": 243,
      "i-108": 244,
      "i-109": 245,
      "i-110": 246,
      "i-111": 247,
      "i-112": 248,
      "i-113": 249,
      "i-114": 250,
      "i-115": 251,
      "i-116": 252,
      "i-117": 253,
      "i-118": 254,
      "i-119": 255,
      "i-120": 256,
      "i-121": 257,
      "i-122": 258,
      "i-123": 259,
      "i-124": 260,
      "i-125": 261,
      "i-126": 262,
      "i-127": 263,
      "i-128": 264,
      "p-0": 265,
      "p-1": 266,
      "p-2": 267,
      "p-3": 268,
      "p-4": 269,
      "p-5": 270,
      "p-6": 271,
      "p-7": 272,
      "p-8": 273,
      "p-9": 274,
      "p-10": 275,
      "p-11": 276,
      "p-12": 277,
      "p-13": 278,
      "p-14": 279,
      "p-15": 280,
      "p-16": 281,
      "p-17": 282,
      "p-18": 283,
      "p-19": 284,
      "p-20": 285,
      "p-21": 286,
      "p-22": 287,
      "p-23": 288,
      "p-24": 289,
      "p-25": 290,
      "p-26": 291,
      "p-27": 292,
      "p-28": 293,
      "p-29": 294,
      "p-30": 295,
      "p-31": 296,
      "p-32": 297,
      "p-33": 298,
      "p-34": 299,
      "p-35": 300,
      "p-36": 301,
      "p-37": 302,
      "p-38": 303,
      "p-39": 304,
      "p-40": 305,
      "p-41": 306,
      "p-42": 307,
      "p-43": 308,
      "p-44": 309,
      "p-45": 310,
      "p-46": 311,
      "p-47": 312,
      "p-48": 313,
      "p-49": 314,
      "p-50": 315,
      "p-51": 316,
      "p-52": 317,
      "p-53": 318,
      "p-54": 319,
      "p-55": 320,
      "p-56": 321,
      "p-57": 322,
      "p-58": 323,
      "p-59": 324,
      "p-60": 325,
      "p-61": 326,
      "p-62": 327,
      "p-63": 328,
      "p-64": 329,
      "p-65": 330,
      "p-66": 331,
      "p-67": 332,
      "p-68": 333,
      "p-69": 334,
      "p-70": 335,
      "p-71": 336,
      "p-72": 337,
      "p-73": 338,
      "p-74": 339,
      "p-75": 340,
      "p-76": 341,
      "p-77": 342,
      "p-78": 343,
      "p-79": 344,
      "p-80": 345,
      "p-81": 346,
      "p-82": 347,
      "p-83": 348,
      "p-84": 349,
      "p-85": 350,
      "p-86": 351,
      "p-87": 352,
      "p-88": 353,
      "p-89": 354,
      "p-90": 355,
      "p-91": 356,
      "p-92": 357,
      "p-93": 358,
      "p-94": 359,
      "p-95": 360,
      "p-96": 361,
      "p-97": 362,
      "p-98": 363,
      "p-99": 364,
      "p-100": 365,
      "p-101": 366,
      "p-102": 367,
      "p-103": 368,
      "p-104": 369,
      "p-105": 370,
      "p-106": 371,
      "p-107": 372,
      "p-108": 373,
      "p-109": 374,
      "p-110": 375,
      "p-111": 376,
      "p-112": 377,
      "p-113": 378,
      "p-114": 379,
      "p-115": 380,
      "p-116": 381,
      "p-117": 382,
      "p-118": 383,
      "p-119": 384,
      "p-120": 385,
      "p-121": 386,
      "p-122": 387,
      "p-123": 388,
      "p-124": 389,
      "p-125": 390,
      "p-126": 391,
      "p-127": 392,
      "p-128": 393,
      "p-129": 394,
      "p-130": 395,
      "p-131": 396,
      "p-132": 397,
      "p-133": 398,
      "p-134": 399,
      "p-135": 400,
      "p-136": 401,
      "p-137": 402,
      "p-138": 403,
      "p-139": 404,
      "p-140": 405,
      "p-141": 406,
      "p-142": 407,
      "p-143": 408,
      "p-144": 409,
      "p-145": 410,
      "p-146": 411,
      "p-147": 412,
      "p-148": 413,
      "p-149": 414,
      "p-150": 415,
      "p-151": 416,
      "p-152": 417,
      "p-153": 418,
      "p-154": 419,
      "p-155": 420,
      "p-156": 421,
      "p-157": 422,
      "p-158": 423,
      "p-159": 424,
      "p-160": 425,
      "p-161": 426,
      "p-162": 427,
      "p-163": 428,
      "p-164": 429,
      "p-165": 430,
      "p-166": 431,
      "p-167": 432,
      "p-168": 433,
      "p-169": 434,
      "p-170": 435,
      "p-171": 436,
      "p-172": 437,
      "p-173": 438,
      "p-174": 439,
      "p-175": 440,
      "p-176": 441,
      "p-177": 442,
      "p-178": 443,
      "p-179": 444,
      "p-180": 445,
      "p-181": 446,
      "p-182": 447,
      "p-183": 448,
      "p-184": 449,
      "p-185": 450,
      "p-186": 451,
      "p-187": 452,
      "p-188": 453,
      "p-189": 454,
      "p-190": 455,
      "p-191": 456,
      "p-192": 457,
      "p-193": 458,
      "p-194": 459,
      "p-195": 460,
      "p-196": 461,
      "p-197": 462,
      "p-198": 463,
      "p-199": 464,
      "p-200": 465,
      "p-201": 466,
      "p-202": 467,
      "p-203": 468,
      "p-204": 469,
      "p-205": 470,
      "p-206": 471,
      "p-207": 472,
      "p-208": 473,
      "p-209": 474,
      "p-210": 475,
      "p-211": 476,
      "p-212": 477,
      "p-213": 478,
      "p-214": 479,
      "p-215": 480,
      "p-216": 481,
      "p-217": 482,
      "p-218": 483,
      "p-219": 484,
      "p-220": 485,
      "p-221": 486,
      "p-222": 487,
      "p-223": 488,
      "p-224": 489,
      "p-225": 490,
      "p-226": 491,
      "p-227": 492,
      "p-228": 493,
      "p-229": 494,
      "p-230": 495,
      "p-231": 496,
      "p-232": 497,
      "p-233": 498,
      "p-234": 499,
      "p-235": 500,
      "p-236": 501,
      "p-237": 502,
      "p-238": 503,
      "p-239": 504,
      "p-240": 505,
      "p-241": 506,
      "p-242": 507,
      "p-243": 508,
      "p-244": 509,
      "p-245": 510,
      "p-246": 511,
      "p-247": 512,
      "p-248": 513,
      "p-249": 514,
      "p-250": 515,
      "p-251": 516,
      "p-252": 517,
      "p-253": 518,
      "p-254": 519,
      "p-255": 520,
      "d-0": 521,
      "d-1": 522,
      "d-2": 523,
      "d-3": 524,
      "d-4": 525,
      "d-5": 526,
      "d-6": 527,
      "d-7": 528,
      "d-8": 529,
      "d-9": 530,
      "d-10": 531,
      "d-11": 532,
      "d-12": 533,
      "d-13": 534,
      "d-14": 535,
      "d-15": 536,
      "d-16": 537,
      "d-17": 538,
      "d-18": 539,
      "d-19": 540,
      "d-20": 541,
      "d-21": 542,
      "d-22": 543,
      "d-23": 544,
      "d-24": 545,
      "d-25": 546,
      "d-26": 547,
      "d-27": 548,
      "d-28": 549,
      "d-29": 550,
      "d-30": 551,
      "d-31": 552,
      "d-32": 553,
      "d-33": 554,
      "d-34": 555,
      "d-35": 556,
      "d-36": 557,
      "d-37": 558,
      "d-38": 559,
      "d-39": 560,
      "d-40": 561,
      "d-41": 562,
      "d-42": 563,
      "d-43": 564,
      "d-44": 565,
      "d-45": 566,
      "d-46": 567,
      "d-47": 568,
      "d-48": 569,
      "d-49": 570,
      "d-50": 571,
      "d-51": 572,
      "d-52": 573,
      "d-53": 574,
      "d-54": 575,
      "d-55": 576,
      "d-56": 577,
      "d-57": 578,
      "d-58": 579,
      "d-59": 580,
      "d-60": 581,
      "d-61": 582,
      "d-62": 583,
      "d-63": 584,
      "d-64": 585,
      "d-65": 586,
      "d-66": 587,
      "d-67": 588,
      "d-68": 589,
      "d-69": 590,
      "d-70": 591,
      "d-71": 592,
      "d-72": 593,
      "d-73": 594,
      "d-74": 595,
      "d-75": 596,
      "d-76": 597,
      "d-77": 598,
      "d-78": 599,
      "d-79": 600,
      "d-80": 601,
      "d-81": 602,
      "d-82": 603,
      "d-83": 604,
      "d-84": 605,
      "d-85": 606,
      "d-86": 607,
      "d-87": 608,
      "d-88": 609,
      "d-89": 610,
      "d-90": 611,
      "d-91": 612,
      "d-92": 613,
      "d-93": 614,
      "d-94": 615,
      "d-95": 616,
      "d-96": 617,
      "d-97": 618,
      "d-98": 619,
      "d-99": 620,
      "d-100": 621,
      "d-101": 622,
      "d-102": 623,
      "d-103": 624,
      "d-104": 625,
      "d-105": 626,
      "d-106": 627,
      "d-107": 628,
      "d-108": 629,
      "d-109": 630,
      "d-110": 631,
      "d-111": 632,
      "d-112": 633,
      "d-113": 634,
      "d-114": 635,
      "d-115": 636,
      "d-116": 637,
      "d-117": 638,
      "d-118": 639,
      "d-119": 640,
      "d-120": 641,
      "d-121": 642,
      "d-122": 643,
      "d-123": 644,
      "d-124": 645,
      "d-125": 646,
      "d-126": 647,
      "d-127": 648,
      "v-0": 649,
      "v-1": 650,
      "v-2": 651,
      "v-3": 652,
      "v-4": 653,
      "v-5": 654,
      "v-6": 655,
      "v-7": 656,
      "v-8": 657,
      "v-9": 658,
      "v-10": 659,
      "v-11": 660,
      "v-12": 661,
      "v-13": 662,
      "v-14": 663,
      "v-15": 664,
      "v-16": 665,
      "v-17": 666,
      "v-18": 667,
      "v-19": 668,
      "v-20": 669,
      "v-21": 670,
      "v-22": 671,
      "v-23": 672,
      "v-24": 673,
      "v-25": 674,
      "v-26": 675,
      "v-27": 676,
      "v-28": 677,
      "v-29": 678,
      "v-30": 679,
      "v-31": 680,
      "s-0": 681,
      "s-1": 682,
      "s-2": 683,
      "s-3": 684,
      "s-4": 685,
      "s-5": 686,
      "s-6": 687,
      "s-7": 688,
      "s-8": 689,
      "s-9": 690,
      "s-10": 691,
      "s-11": 692,
      "s-12": 693,
      "s-13": 694,
      "s-14": 695,
      "s-15": 696,
      "s-16": 697,
      "s-17": 698,
      "s-18": 699,
      "s-19": 700,
      "s-20": 701,
      "s-21": 702,
      "s-22": 703,
      "s-23": 704,
      "s-24": 705,
      "s-25": 706,
      "s-26": 707,
      "s-27": 708,
      "s-28": 709,
      "s-29": 710,
      "s-30": 711,
      "s-31": 712,
      "s-32": 713,
      "s-33": 714,
      "s-34": 715,
      "s-35": 716,
      "s-36": 717,
      "s-37": 718,
      "s-38": 719,
      "s-39": 720,
      "s-40": 721,
      "s-41": 722,
      "s-42": 723,
      "s-43": 724,
      "s-44": 725,
      "s-45": 726,
      "s-46": 727,
      "s-47": 728,
      "s-48": 729,
      "s-49": 730,
      "s-50": 731,
      "s-51": 732,
      "s-52": 733,
      "s-53": 734,
      "s-54": 735,
      "s-55": 736,
      "s-56": 737,
      "s-57": 738,
      "s-58": 739,
      "s-59": 740,
      "s-60": 741,
      "s-61": 742,
      "s-62": 743,
      "s-63": 744,
      "s-64": 745,
      "s-65": 746,
      "s-66": 747,
      "s-67": 748,
      "s-68": 749,
      "s-69": 750,
      "s-70": 751,
      "s-71": 752,
      "s-72": 753,
      "s-73": 754,
      "s-74": 755,
      "s-75": 756,
      "s-76": 757,
      "s-77": 758,
      "s-78": 759,
      "s-79": 760,
      "s-80": 761,
      "s-81": 762,
      "s-82": 763,
      "s-83": 764,
      "s-84": 765,
      "s-85": 766,
      "s-86": 767,
      "s-87": 768,
      "s-88": 769,
      "s-89": 770,
      "s-90": 771,
      "s-91": 772,
      "s-92": 773,
      "s-93": 774,
      "s-94": 775,
      "s-95": 776,
      "s-96": 777,
      "s-97": 778,
      "s-98": 779,
      "s-99": 780,
      "s-100": 781,
      "s-101": 782,
      "s-102": 783,
      "s-103": 784,
      "s-104": 785,
      "s-105": 786,
      "s-106": 787,
      "s-107": 788,
      "s-108": 789,
      "s-109": 790,
      "s-110": 791,
      "s-111": 792,
      "s-112": 793,
      "s-113": 794,
      "s-114": 795,
      "s-115": 796,
      "s-116": 797,
      "s-117": 798,
      "s-118": 799,
      "s-119": 800,
      "s-120": 801,
      "s-121": 802,
      "s-122": 803,
      "s-123": 804,
      "s-124": 805,
      "s-125": 806,
      "s-126": 807,
      "s-127": 808,
      "s-128": 809,
      "s-129": 810,
      "s-130": 811,
      "s-131": 812,
      "s-132": 813,
      "s-133": 814,
      "s-134": 815,
      "s-135": 816,
      "s-136": 817,
      "s-137": 818,
      "s-138": 819,
      "s-139": 820,
      "s-140": 821,
      "s-141": 822,
      "s-142": 823,
      "s-143": 824,
      "s-144": 825,
      "s-145": 826,
      "s-146": 827,
      "s-147": 828,
      "s-148": 829,
      "s-149": 830,
      "s-150": 831,
      "s-151": 832,
      "s-152": 833,
      "s-153": 834,
      "s-154": 835,
      "s-155": 836,
      "s-156": 837,
      "s-157": 838,
      "s-158": 839,
      "s-159": 840,
      "s-160": 841,
      "s-161": 842,
      "s-162": 843,
      "s-163": 844,
      "s-164": 845,
      "s-165": 846,
      "s-166": 847,
      "s-167": 848,
      "s-168": 849,
      "s-169": 850,
      "s-170": 851,
      "s-171": 852,
      "s-172": 853,
      "s-173": 854,
      "s-174": 855,
      "s-175": 856,
      "s-176": 857,
      "s-177": 858,
      "s-178": 859,
      "s-179": 860,
      "s-180": 861,
      "s-181": 862,
      "s-182": 863,
      "s-183": 864,
      "s-184": 865,
      "s-185": 866,
      "s-186": 867,
      "s-187": 868,
      "s-188": 869,
      "s-189": 870,
      "s-190": 871,
      "s-191": 872,
      "s-192": 873,
      "s-193": 874,
      "s-194": 875,
      "s-195": 876,
      "s-196": 877,
      "s-197": 878,
      "s-198": 879,
      "s-199": 880,
      "s-200": 881,
      "s-201": 882,
      "s-202": 883,
      "s-203": 884,
      "s-204": 885,
      "s-205": 886,
      "s-206": 887,
      "s-207": 888,
      "s-208": 889,
      "s-209": 890,
      "s-210": 891,
      "s-211": 892,
      "s-212": 893,
      "s-213": 894,
      "s-214": 895,
      "s-215": 896,
      "s-216": 897,
      "s-217": 898,
      "s-218": 899,
      "s-219": 900,
      "s-220": 901,
      "s-221": 902,
      "s-222": 903,
      "s-223": 904,
      "s-224": 905,
      "s-225": 906,
      "s-226": 907,
      "s-227": 908,
      "s-228": 909,
      "s-229": 910,
      "s-230": 911,
      "s-231": 912,
      "s-232": 913,
      "s-233": 914,
      "s-234": 915,
      "s-235": 916,
      "s-236": 917,
      "s-237": 918,
      "s-238": 919,
      "s-239": 920,
      "s-240": 921,
      "s-241": 922,
      "s-242": 923,
      "s-243": 924,
      "s-244": 925,
      "s-245": 926,
      "s-246": 927,
      "s-247": 928,
      "s-248": 929,
      "s-249": 930,
      "s-250": 931,
      "s-251": 932,
      "s-252": 933,
      "s-253": 934,
      "t-0": 935,
      "t-1": 936,
      "t-2": 937,
      "t-3": 938,
      "t-4": 939,
      "t-5": 940,
      "t-6": 941,
      "t-7": 942,
      "t-8": 943,
      "t-9": 944,
      "t-10": 945,
      "t-11": 946,
      "t-12": 947,
      "t-13": 948,
      "t-14": 949,
      "t-15": 950,
      "t-16": 951,
      "t-17": 952,
      "t-18": 953,
      "t-19": 954,
      "t-20": 955,
      "t-21": 956,
      "t-22": 957,
      "t-23": 958,
      "t-24": 959,
      "t-25": 960,
      "t-26": 961,
      "t-27": 962,
      "t-28": 963,
      "t-29": 964,
      "t-30": 965,
      "t-31": 966,
      "t-32": 967,
      "t-33": 968,
      "t-34": 969,
      "t-35": 970,
      "t-36": 971,
      "t-37": 972,
      "t-38": 973,
      "t-39": 974,
      "t-40": 975,
      "t-41": 976,
      "t-42": 977,
      "t-43": 978,
      "t-44": 979,
      "t-45": 980,
      "t-46": 981,
      "t-47": 982,
      "t-48": 983,
      "e-0": 984,
      "e-1": 985,
      "<sep>": 986,
      "I1s2_0_0": 987,
      "I1s2_0_1": 988,
      "I1s2_0_2": 989,
      "I1s2_1_0": 990,
      "I1s2_1_1": 991,
      "I1s2_1_2": 992,
      "I1s2_2_0": 993,
      "I1s2_2_1": 994,
      "I1s2_2_2": 995,
      "I1s2_3_0": 996,
      "I1s2_3_1": 997,
      "I1s2_3_2": 998,
      "I1s2_4_0": 999,
      "I1s2_4_1": 1000,
      "I1s2_4_2": 1001,
      "I1s2_5_0": 1002,
      "I1s2_5_1": 1003,
      "I1s2_5_2": 1004,
      "I1s2_6_0": 1005,
      "I1s2_6_1": 1006,
      "I1s2_6_2": 1007,
      "I1s2_7_0": 1008,
      "I1s2_7_1": 1009,
      "I1s2_7_2": 1010,
      "I1s2_8_0": 1011,
      "I1s2_8_1": 1012,
      "I1s2_8_2": 1013,
      "I1s2_9_0": 1014,
      "I1s2_9_1": 1015,
      "I1s2_9_2": 1016,
      "I1s2_10_0": 1017,
      "I1s2_10_1": 1018,
      "I1s2_10_2": 1019,
      "I1s2_11_0": 1020,
      "I1s2_11_1": 1021,
      "I1s2_11_2": 1022,
      "I1s2_12_0": 1023,
      "I1s2_12_1": 1024,
      "I1s2_12_2": 1025,
      "I1s2_13_0": 1026,
      "I1s2_13_1": 1027,
      "I1s2_13_2": 1028,
      "I1s2_14_0": 1029,
      "I1s2_14_1": 1030,
      "I1s2_14_2": 1031,
      "I1s2_15_0": 1032,
      "I1s2_15_1": 1033,
      "I1s2_15_2": 1034,
      "I1s2_16_0": 1035,
      "I1s2_16_1": 1036,
      "I1s2_16_2": 1037,
      "I1s2_17_0": 1038,
      "I1s2_17_1": 1039,
      "I1s2_17_2": 1040,
      "I1s2_18_0": 1041,
      "I1s2_18_1": 1042,
      "I1s2_18_2": 1043,
      "I1s2_19_0": 1044,
      "I1s2_19_1": 1045,
      "I1s2_19_2": 1046,
      "I1s2_20_0": 1047,
      "I1s2_20_1": 1048,
      "I1s2_20_2": 1049,
      "I1s2_21_0": 1050,
      "I1s2_21_1": 1051,
      "I1s2_21_2": 1052,
      "I1s2_22_0": 1053,
      "I1s2_22_1": 1054,
      "I1s2_22_2": 1055,
      "I1s2_23_0": 1056,
      "I1s2_23_1": 1057,
      "I1s2_23_2": 1058,
      "I1s2_24_0": 1059,
      "I1s2_24_1": 1060,
      "I1s2_24_2": 1061,
      "I1s2_25_0": 1062,
      "I1s2_25_1": 1063,
      "I1s2_25_2": 1064,
      "I1s2_26_0": 1065,
      "I1s2_26_1": 1066,
      "I1s2_26_2": 1067,
      "I1s2_27_0": 1068,
      "I1s2_27_1": 1069,
      "I1s2_27_2": 1070,
      "I4_0": 1071,
      "I4_1": 1072,
      "I4_2": 1073,
      "I4_3": 1074,
      "I4_4": 1075,
      "I4_5": 1076,
      "I4_6": 1077,
      "I4_7": 1078,
      "I4_8": 1079,
      "I4_9": 1080,
      "I4_10": 1081,
      "I4_11": 1082,
      "I4_12": 1083,
      "I4_13": 1084,
      "I4_14": 1085,
      "I4_15": 1086,
      "I4_16": 1087,
      "I4_17": 1088,
      "I4_18": 1089,
      "I4_19": 1090,
      "I4_20": 1091,
      "I4_21": 1092,
      "I4_22": 1093,
      "I4_23": 1094,
      "I4_24": 1095,
      "I4_25": 1096,
      "I4_26": 1097,
      "I4_27": 1098,
      "I4_28": 1099,
      "C1_0": 1100,
      "C1_1": 1101,
      "C1_2": 1102,
      "C1_3": 1103,
      "C1_4": 1104,
      "R1_0": 1105,
      "R1_1": 1106,
      "R1_2": 1107,
      "R3_0": 1108,
      "R3_1": 1109,
      "R3_2": 1110,
      "R3_3": 1111,
      "S2s1_0": 1112,
      "S2s1_1": 1113,
      "S2s1_2": 1114,
      "S2s1_3": 1115,
      "S2s1_4": 1116,
      "S2s1_5": 1117,
      "S2s1_6": 1118,
      "S2s1_7": 1119,
      "S2s1_8": 1120,
      "S2s1_9": 1121,
      "S2s1_10": 1122,
      "S2s1_11": 1123,
      "S2s1_12": 1124,
      "S2s1_13": 1125,
      "S2s1_14": 1126,
      "S2s1_15": 1127,
      "S2s1_16": 1128,
      "S2s1_17": 1129,
      "S4_0_0": 1130,
      "S4_0_1": 1131,
      "S4_0_2": 1132,
      "S4_1_0": 1133,
      "S4_1_1": 1134,
      "S4_1_2": 1135,
      "S4_2_0": 1136,
      "S4_2_1": 1137,
      "S4_2_2": 1138,
      "S4_3_0": 1139,
      "S4_3_1": 1140,
      "S4_3_2": 1141,
      "S4_4_0": 1142,
      "S4_4_1": 1143,
      "S4_4_2": 1144,
      "S4_5_0": 1145,
      "S4_5_1": 1146,
      "S4_5_2": 1147,
      "S4_6_0": 1148,
      "S4_6_1": 1149,
      "S4_6_2": 1150,
      "S4_7_0": 1151,
      "S4_7_1": 1152,
      "S4_7_2": 1153,
      "S4_8_0": 1154,
      "S4_8_1": 1155,
      "S4_8_2": 1156,
      "S4_9_0": 1157,
      "S4_9_1": 1158,
      "S4_9_2": 1159,
      "S4_10_0": 1160,
      "S4_10_1": 1161,
      "S4_10_2": 1162,
      "S4_11_0": 1163,
      "S4_11_1": 1164,
      "S4_11_2": 1165,
      "S4_12_0": 1166,
      "S4_12_1": 1167,
      "S4_12_2": 1168,
      "S4_13_0": 1169,
      "S4_13_1": 1170,
      "S4_13_2": 1171,
      "S4_14_0": 1172,
      "S4_14_1": 1173,
      "S4_14_2": 1174,
      "S4_15_0": 1175,
      "S4_15_1": 1176,
      "S4_15_2": 1177,
      "S4_16_0": 1178,
      "S4_16_1": 1179,
      "S4_16_2": 1180,
      "S4_17_0": 1181,
      "S4_17_1": 1182,
      "S4_17_2": 1183,
      "S4_18_0": 1184,
      "S4_18_1": 1185,
      "S4_18_2": 1186,
      "S4_19_0": 1187,
      "S4_19_1": 1188,
      "S4_19_2": 1189,
      "S4_20_0": 1190,
      "S4_20_1": 1191,
      "S4_20_2": 1192,
      "S4_21_0": 1193,
      "S4_21_1": 1194,
      "S4_21_2": 1195,
      "B1s1_0": 1196,
      "B1s1_1": 1197,
      "B1s1_2": 1198,
      "B1s1_3": 1199,
      "B1s1_4": 1200,
      "TS1s1_0": 1201,
      "TS1s1_1": 1202,
      "TS1s1_2": 1203,
      "TS1s1_3": 1204,
      "TS1s1_4": 1205,
      "TS1s1_5": 1206,
      "TS1s1_6": 1207,
      "TS1s1_7": 1208,
      "K1_0": 1209,
      "K1_1": 1210,
      "K1_2": 1211,
      "T1s1_0": 1212,
      "T1s1_1": 1213,
      "T1s1_2": 1214,
      "T1s1_3": 1215,
      "P4_0": 1216,
      "P4_1": 1217,
      "P4_2": 1218,
      "P4_3": 1219,
      "P4_4": 1220,
      "P4_5": 1221,
      "P4_6": 1222,
      "P4_7": 1223,
      "P4_8": 1224,
      "P4_9": 1225,
      "P4_10": 1226,
      "P4_11": 1227,
      "P4_12": 1228,
      "ST1_0": 1229,
      "ST1_1": 1230,
      "ST1_2": 1231,
      "ST1_3": 1232,
      "ST1_4": 1233,
      "ST1_5": 1234,
      "ST1_6": 1235,
      "ST1_7": 1236,
      "ST1_8": 1237,
      "ST1_9": 1238,
      "ST1_10": 1239,
      "ST1_11": 1240,
      "ST1_12": 1241,
      "ST1_13": 1242,
      "ST1_14": 1243,
      "EM1_0": 1244,
      "EM1_1": 1245,
      "EM1_2": 1246,
      "EM1_3": 1247,
      "EM1_4": 1248,
      "TM1_0": 1249,
      "TM1_1": 1250,
      "TM1_2": 1251,
      "TM1_3": 1252,
      "TM1_4": 1253,
      "TM1_5": 1254
    },
    "unk_token": "[UNK]"
  }
}