{
    "I1_1": [
        "Có [INSTRUMENTS] trong đoạn nhạc.", 
        "Có [INSTRUMENTS] xuất hiện trong đoạn nhạc.",
        "Trong đoạn nhạc có [INSTRUMENTS].",
        "Trong đoạn nhạc có [INSTRUMENTS] xuất hiện.",
        "Trong đoạn nhạc có nhạc cụ là [INSTRUMENTS] xuất hiện."
    ], 
    "I1_0": [
        "Không có nhạc cụ [INSTRUMENTS] trong đoạn nhạc.", 
        "Không có nhạc cụ [INSTRUMENTS] xuất hiện trong đoạn nhạc.",
        "Không có đàn [INSTRUMENTS] trong đoạn nhạc.", 
        "Không có đàn [INSTRUMENTS] xuất hiện trong đoạn nhạc.",
        "Trong đoạn nhạc không có đàn [INSTRUMENTS].",
        "Trong đoạn nhạc không có đàn [INSTRUMENTS] xuất hiện.",
        "Trong đoạn nhạc không có nhạc cụ [INSTRUMENTS].",
        "Trong đoạn nhạc không có nhạc cụ [INSTRUMENTS] xuất hiện."
    ], 
    "P4_1": [
        "Khoảng cách cao độ giữa nốt có cao độ thấp nhất và nốt có cao độ cao nhất trong đoạn nhạc không vượt quá [RANGE] quãng tám.", 
        "Khoảng cách cao độ giữa hai nốt bất kỳ trong đoạn nhạc luôn không vượt quá [RANGE] quãng tám.",
        "Giữa hai nốt bất kỳ trong đoạn nhạc luôn có khoảng cách cao độ không vượt quá [RANGE] quãng tám."
    ],
    "C1_0": [
        "Đây là một bài hát tươi sáng.",
        "Toàn bộ bài hát cho người nghe cảm giác tươi sáng."
    ],
    "C1_1": [
        "Đây là một bài hát buồn bã.",
        "Toàn bộ bài hát cho người nghe cảm giác buồn bã."
    ],
    "C1_2": [
        "Bài hát bắt đầu với cảm giác tươi sáng, sau đó trở nên buồn dần về cuối.",
        "Bài hát bắt đầu với cảm giác tươi sáng, sau đó trở nên buồn.",
        "Bài hát bắt đầu với cảm giác tươi sáng, sau đó trở nên buồn bã.",
        "Bài hát bắt đầu với cảm giác tươi sáng, sau đó trở nên buồn bã về cuối.",
        "Bài hát có đoạn đầu vui và đoạn cuối buồn.",
        "Bài hát có đoạn đầu vui và đoạn cuối buồn bã."
    ], 
    "C1_3": [
        "Bài hát bắt đầu với cảm giác buồn bã, sau đó trở nên tươi sáng dần về cuối.",
        "Bài hát bắt đầu với cảm giác buồn bã, sau đó trở nên tươi sáng.",
        "Bài hát bắt đầu với cảm giác buồn bã, sau đó trở nên tươi sáng về cuối.",
        "Bài hát bắt đầu với cảm giác buồn bã, sau đó trở nên tươi sáng dần.",
        "Bài hát có đoạn đầu buồn và đoạn cuối vui.",
        "Bài hát có đoạn đầu buồn bã và đoạn cuối vui."
    ],
    "R1_1": [
        "Bài hát này khiến người nghe muốn nhảy múa.",
        "Bài hát này có tính nhảy múa cao.",
        "Bài hát này thích hợp để nhảy múa.",
        "Bài hát này phù hợp cho việc nhảy múa."
    ],
    "R1_0": [
        "Bài hát này không phù hợp để nhảy múa.",
        "Bài hát này không có tính nhảy múa cao.",
        "Bài hát này không thích hợp để nhảy múa.",
        "Bài hát này không phù hợp để nhảy múa.",
        "Bài hát này không thích hợp cho việc nhảy múa.",
        "Bài hát này không phù hợp cho việc nhảy múa."
    ],
    "R3_1": [
        "Bài hát này có nhịp điệu rất mạnh mẽ.",
        "Bài hát này có nhịp điệu khá mạnh mẽ.",
        "Nhịp điệu của bài hát này rất mạnh mẽ.",
        "Nhịp điệu của bài hát này khá mạnh mẽ."
    ],
    "R3_0": [
        "Bài hát này có nhịp điệu nhẹ nhàng.",
        "Bài hát này có nhịp điệu khá nhẹ nhàng.",
        "Nhịp điệu của bài hát này nhẹ nhàng.",
        "Nhịp điệu của bài hát này khá nhẹ nhàng.",
        "Bài hát này có nhịp điệu êm ái.",
        "Bài hát này có nhịp điệu khá êm ái.",
        "Nhịp điệu của bài hát này êm ái.",
        "Nhịp điệu của bài hát này khá êm ái."
    ],
    "R3_2": [
        "Bài hát này có nhịp điệu vừa phải.",
        "Nhịp điệu của bài hát này vừa phải."
    ], 
    "S4_1": [
        "Bài hát này phù hợp với phong cách [GENRE].",
        "Bài hát này thuộc phong cách [GENRE].",
        "Bài hát này có phong cách [GENRE].",
        "Bài hát này là bài hát [GENRE].",
        "Bài hát này là bài hát thuộc phong cách [GENRE].",
        "Bài hát này phù hợp với thể loại [GENRE].",
        "Bài hát này thuộc thể loại [GENRE].",
        "Bài hát này có thể loại [GENRE].",
        "Bài hát này là bài hát [GENRE].",
        "Bài hát này là bài hát thuộc thể loại [GENRE]."
    ],
    "S4_0": [
        "Bài hát này không phù hợp với phong cách [GENRE].",
        "Bài hát này không thuộc phong cách [GENRE].",
        "Bài hát này không có phong cách [GENRE].",
        "Bài hát này không phải là bài hát [GENRE].",
        "Bài hát này không phải là bài hát thuộc phong cách [GENRE].",
        "Bài hát này không phù hợp với thể loại [GENRE].",
        "Bài hát này không thuộc thể loại [GENRE].",
        "Bài hát này không có thể loại [GENRE].",
        "Bài hát này không phải là bài hát [GENRE].",
        "Bài hát này không phải là bài hát thuộc thể loại [GENRE]."
    ],
    "S2_1": [
        "Bài hát này có đặc trưng thường thấy của nghệ sĩ [ARTIST].",
        "Bài hát này giống với phong cách thường thấy của nghệ sĩ [ARTIST].",
        "Bài hát này giống với phong cách âm nhạc của [ARTIST]."
    ],
    "S2_0": [
        "Bài hát này không có đặc trưng thường thấy của nghệ sĩ [ARTIST].",
        "Bài hát này không giống với phong cách thường thấy của nghệ sĩ [ARTIST].",
        "Bài hát này không giống với phong cách âm nhạc của [ARTIST]."
    ],
    "B1_1": [
        "Bài hát này có khoảng [NUM_BARS] bar(s) nhạc.", 
        "Bài hát này có khoảng [NUM_BARS] bar(s).",
        "Bài hát này có độ dài khoảng [NUM_BARS] bar(s).",
        "Bài hát này dài khoảng [NUM_BARS] bar(s)."
    ],
    "TS1_1": [
        "Bài hát này viết ở nhịp [TIME_SIGNATURE].",
        "Bài hát này có nhịp [TIME_SIGNATURE].",
        "Nhịp của bài hát này là [TIME_SIGNATURE]."
    ],
    "TS1_o": [
        "Bài hát này có nhịp ít gặp.",
        "Bài hát này có nhịp hiếm gặp.",
        "Nhịp của bài hát này ít gặp.",
        "Nhịp của bài hát này hiếm gặp.",
        "Nhịp của bài hát này ít khi được sử dụng.",
        "Nhịp của bài hát này ít phổ biến."
    ],
    "K1_1": [
        "Bài hát này được viết ở giọng [KEY].",
        "Bài hát này có giọng [KEY].",
        "Giọng của bài hát này là [KEY]."
    ],
    "T1_0": [
        "Tốc độ của bài hát này nhanh.",
        "Bài hát này nhanh.",
        "Bài hát này có tốc độ nhanh."
    ],
    "T1_1": [
        "Tốc độ của bài hát này chậm.",
        "Bài hát này chậm.",
        "Bài hát này có tốc độ chậm."
    ],
    "T1_2": [
        "Tốc độ của bài hát này vừa phải.",
        "Bài hát này có tốc độ vừa phải."
    ],
    "EM1_1": [
        "Bài hát này truyền tải cảm xúc [EMOTION].",
        "Bài hát này có cảm xúc [EMOTION].",
        "Bài hát này làm người nghe cảm thấy [EMOTION]."
    ],
    "TM1_1": [
        "Bài hát dài khoảng [TM1] giây.",
        "Bài hát này có độ dài khoảng [TM1] giây.",
        "Bài hát này dài khoảng [TM1] giây."
    ]
}